src/Catalogs/СценарииОбменовДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СценарииОбменовДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелИнформационнойБазы</Name>
							<Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТранспортаОбмена</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЭлементовВТранзакции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполняемоеДействие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияПриОбмене</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СценарииОбменовДанными/Forms/НастройкаРасписанияЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФлагИспользования = Параметры.ФлагИспользования;
	ФлагИспользованияПредыдущий = ФлагИспользования;
	
	// ВАРИАНТЫ НАСТРОЙКИ РАСПИСАНИЯ ВЫПОЛНЕНИЯ ОБМЕНА
	
	МенеджерПланаОбмена = ОбменДаннымиПовтИсп.ПолучитьМенеджерПланаОбмена(Параметры.УзелИнформационнойБазы);
	
	ВариантыНастройкиРасписанияПользовательские = МенеджерПланаОбмена.ВариантыНастройкиРасписания();
	
	СписокВыбора = Элементы.РасписаниеРегламентногоЗаданияСтрокой.СписокВыбора;
	
	СписокВыбора.Добавить(ЗначениеВСтрокуВнутр(Новый РасписаниеРегламентногоЗадания), НСтр("ru = 'Не задано'"));
	
	Для Каждого ВариантНастройки ИЗ ВариантыНастройкиРасписанияПользовательские Цикл
		
		СписокВыбора.Добавить(ЗначениеВСтрокуВнутр(ВариантНастройки.Значение), ВариантНастройки.Представление);
		
	КонецЦикла;
	
	РасписаниеРегламентногоЗадания = Справочники.СценарииОбменовДанными.ПолучитьРасписаниеВыполненияОбменаДанными(Параметры.Ключ);
	
	РасписаниеРегламентногоЗаданияСтрокой = ЗначениеВСтрокуВнутр(РасписаниеРегламентногоЗадания);
	
	Если СписокВыбора.НайтиПоЗначению(РасписаниеРегламентногоЗаданияСтрокой) = Неопределено Тогда
		
		СписокВыбора.Добавить(РасписаниеРегламентногоЗаданияСтрокой, Строка(РасписаниеРегламентногоЗадания));
		
	КонецЕсли;
	
	// доступность элементов
	Элементы.ЭлементыРасписания.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	
	// заголовок формы
	Заголовок = НСтр("ru = 'Настройка расписания для: [УзелИнформационнойБазы]'");
	Заголовок = СтрЗаменить(Заголовок, "[УзелИнформационнойБазы]", Строка(Параметры.УзелИнформационнойБазы));
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры

// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры

// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры



&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.СценарииОбменовДанными.ОбновитьДанныеРегламентногоЗадания(Отказ, ЗначениеИзСтрокиВнутр(РасписаниеРегламентногоЗаданияСтрокой), ТекущийОбъект);
	
	ФлагИспользованияИзменен = (ФлагИспользования <> ФлагИспользованияПредыдущий);
	
	ФлагИспользованияПредыдущий = ФлагИспользования;
	
	ЭтоНовый = (Объект.Ссылка.Пустая());
	
	Если ФлагИспользованияИзменен ИЛИ ЭтоНовый Тогда
		
		Если ФлагИспользования Тогда
			
			Справочники.СценарииОбменовДанными.ДобавитьВыгрузкуВСценарииОбменаДанными(ТекущийОбъект, Параметры.УзелИнформационнойБазы);
			Справочники.СценарииОбменовДанными.ДобавитьЗагрузкуВСценарииОбменаДанными(ТекущийОбъект, Параметры.УзелИнформационнойБазы);
		Иначе
			
			Справочники.СценарииОбменовДанными.УдалитьВыгрузкуВСценарииОбменаДанными(ТекущийОбъект, Параметры.УзелИнформационнойБазы);
			Справочники.СценарииОбменовДанными.УдалитьЗагрузкуВСценарииОбменаДанными(ТекущийОбъект, Параметры.УзелИнформационнойБазы);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанСценарийОбменаДанными");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РасписаниеРегламентногоЗаданияСтрокойПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентноеЗаданиеПриИзменении(Элемент)
	
	Элементы.ЭлементыРасписания.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьРасписание(Команда)
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания(РасписаниеРегламентногоЗаданияСтрокой));
	
	// открываем диалог для редактирования Расписания
	Диалог.Показать(Новый ОписаниеОповещения("ИзменитьРасписаниеЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьРасписаниеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	
	Если Расписание Тогда
		
		ОбновитьСписокВыбораРасписанияРегламентногоЗадания(Диалог.Расписание);
		
		Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораРасписанияРегламентногоЗадания(Знач Расписание)
	
	РасписаниеРегламентногоЗаданияСтрокой = ЗначениеВСтрокуВнутр(Расписание);
	
	СписокВыбора = Элементы.РасписаниеРегламентногоЗаданияСтрокой.СписокВыбора;
	
	Если СписокВыбора.НайтиПоЗначению(РасписаниеРегламентногоЗаданияСтрокой) = Неопределено Тогда
		
		СписокВыбора.Добавить(РасписаниеРегламентногоЗаданияСтрокой, Строка(Расписание));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасписаниеРегламентногоЗадания(РасписаниеРегламентногоЗаданияСтрокой)
	
	Возврат ЗначениеИзСтрокиВнутр(РасписаниеРегламентногоЗаданияСтрокой);
	
КонецФункции

#КонецОбласти
